esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3u/svd/SAM3U2E.svd
        <register>
          <name>IPFEATURES</name>
          <description>UDPHS Features Register</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EPT_NBR_MAX</name>
              <description>Max Number of Endpoints</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CHANNEL_NBR</name>
              <description>Number of DMA Channels</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_B_SIZ</name>
              <description>DMA Buffer Size</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_FIFO_WORD_DEPTH</name>
              <description>DMA FIFO Depth in Words</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_MAX_SIZE</name>
              <description>DPRAM Size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BW_DPRAM</name>
              <description>DPRAM Byte Write Capability</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAB16_8</name>
              <description>UTMI DataBus16_8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_1</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_2</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_3</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_4</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_5</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_6</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_7</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_8</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_9</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_10</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_11</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_12</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_13</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_14</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_EPT_15</name>
              <description>Endpointx High Bandwidth Isochronous Capability</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCFG0</name>
          <description>UDPHS Endpoint Configuration Register (endpoint = 0)</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EPT_SIZE</name>
              <description>Endpoint Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPT_DIR</name>
              <description>Endpoint Direction</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_TYPE</name>
              <description>Endpoint Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL8</name>
                  <description>Control endpoint</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO</name>
                  <description>Isochronous endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk endpoint</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt endpoint</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BK_NUMBER</name>
              <description>Number of Banks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Zero bank, the endpoint is not mapped in memory</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>One bank (bank 0)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Double bank (Ping-Pong: bank0/bank1)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Triple bank (bank0/bank1/bank2)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB_TRANS</name>
              <description>Number Of Transaction per Microframe</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_MAPD</name>
              <description>Endpoint Mapped</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCTLENB0</name>
          <description>UDPHS Endpoint Control Enable Register (endpoint = 0)</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EPT_ENABL</name>
              <description>Endpoint Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AUTO_VALID</name>
              <description>Packet Auto-Valid Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INTDIS_DMA</name>
              <description>Interrupts Disable DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NYET_DIS</name>
              <description>NYET Disable (Only for High Speed Bulk OUT endpoints)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATAX_RX</name>
              <description>DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MDATA_RX</name>
              <description>MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_BK_RDY</name>
              <description>Received OUT Data Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_PK_RDY</name>
              <description>TX Packet Ready/Transaction Error Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_TRANS</name>
              <description>TX Packet Ready/Transaction Error Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP/Error Flow Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Received SETUP/Error Flow Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_CRISO</name>
              <description>Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_NBTRA</name>
              <description>Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAKIN/Bank Flush Error Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>NAKIN/Bank Flush Error Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAKOUT Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUSY_BANK</name>
              <description>Busy Bank Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet Send/Short Packet Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
